from datetime import datetime

today_date = datetime.today().strftime('%Y-%m-%d')
keywords = ["بيانات", 
            "البيانات",
            "مستودع بيانات",
            "مستودع البيانات",
            "حوكمة بيانات",
            "حوكمة البيانات",
]

# keywords = ["بيانات", 
#             "البيانات",
#             "مستودع بيانات",
#             "مستودع البيانات",
#             "حوكمة بيانات",
#             "حوكمة البيانات",
#             "دليل",
#             "مكتب البيانات",
#             "مكتب بيانات",
#             "مكتب إدارة البيانات",
#             "تأسيس",
#             "تفعيل",
#             "تشغيل",
#             "تأسيس وتفعيل",
#             "توريد تراخيص",
#             "توريد رخص",
#             "توفير رخص",
#             "تجديد",
#             "دليل البيانات",
#             "البيانات الرئيسية والمرجعية",
#             "ذكاء الأعمال",
#             "الذكاء الاصطناعي",
#             "تحليل البيانات",
#             "البيانات غير المهيكلة",
#             "ادارة معجم الأعمال",
#             "نظام ادارة وحوكمة البيانات",
#             "انفورماتيكا",
#             "تعلم الالة",
#             "ذكاء",
#             "احصاء",
#             "الاحصاء",
#             "API",
#             "التطبيقات"          
# ]

# keywords = keywords[3:]

to_exclude = ["دعم فني",
"الدعم الفني",
"بنية تحتية",
"أنظمة الشبكة",
"تجديد عقود",
"تشغيل وصيانة",
"تشغيل البوابة الإلكترونية",
"خدمات الاستضافة",
"مرابقة أداء التطبيقات",
"السيبرانية",
"توسعة البنية التحتية",
"رابسودي",
"صيانة وتشغيل",
"برنامج مشاركة الملفات",
"تشغيل وصيانة البنية التحتية",
"حماية الأجهزة",
"نظام تخزين ومشاركة الملفات",
"صيانة",
"مركز البيانات الاحتياطي",
"نظام أرشفة",
"انظمة التعافي من الكوارث"]


#to_addresses = ['dme.di.tender@devoteam.com']
to_addresses = ['omarkamalabuassaf1@gmail.com']
# to_addresses = ['tariq.khasawneh@devoteam.com', 'tariq.khasawneh.93@gmail.com']
subject = f'Subject: RFPs from Etimad for {today_date}'
body = f'Kindly find attached the extracted tender requests for {today_date} :)'